###  Part # 2
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

                  = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "prod"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-075a425987d17481c"
      + tags                                 = {
          + "App"   = "Web"
          + "Name"  = "prod-Amazon-Linux-Private"
          + "Owner" = "CAAacs730"
          + "env"   = "prod"
        }
      + tags_all                             = {
          + "App"   = "Web"
          + "Name"  = "prod-Amazon-Linux-Private"
          + "Owner" = "CAAacs730"
          + "env"   = "prod"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_security_group.web_sg will be created
  + resource "aws_security_group" "web_sg" {
      + arn                    = (known after apply)
      + description            = "Allow SSH inbound traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "allow_ssh"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "App"   = "Web"
          + "Name"  = "prod-SG-Private-nonprod"
          + "Owner" = "CAAacs730"
          + "env"   = "prod"
        }
      + tags_all               = {
          + "App"   = "Web"
          + "Name"  = "prod-SG-Private-nonprod"
          + "Owner" = "CAAacs730"
          + "env"   = "prod"
        }
      + vpc_id                 = "vpc-00bbdff316127afad"
    }

  # aws_security_group.web_sg_public will be created
  + resource "aws_security_group" "web_sg_public" {
      + arn                    = (known after apply)
      + description            = "Allow HTTP and SSH inbound traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP from everywhere"
              + from_port        = 80
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH from everywhere"
              + from_port        = 22
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "allow_http_ssh"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "App"   = "Web"
          + "Name"  = "prod-SG-Public-nonprod"
          + "Owner" = "CAAacs730"
          + "env"   = "prod"
        }
      + tags_all               = {
          + "App"   = "Web"
          + "Name"  = "prod-SG-Public-nonprod"
          + "Owner" = "CAAacs730"
          + "env"   = "prod"
        }
      + vpc_id                 = "vpc-00bbdff316127afad"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ web_sg_public = "sg-032b6be408d47fb02" -> (known after apply)
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply":%0A%0A  # aws_instance.acs730-webserver[0] has been deleted%0A  - resource "aws_instance" "acs730-webserver" {%0A      - ami                                  = "ami-05034109c18473f00" -> null%0A      - arn                                  = "arn:aws:ec2:us-east-1:775273113262:instance/i-050dbbd991d26ba08" -> null%0A      - associate_public_ip_address          = true -> null%0A      - availability_zone                    = "us-east-1a" -> null%0A      - cpu_core_count                       = 1 -> null%0A      - cpu_threads_per_core                 = 1 -> null%0A      - disable_api_stop                     = false -> null%0A      - disable_api_termination              = false -> null%0A      - ebs_optimized                        = false -> null%0A      - get_password_data                    = false -> null%0A      - hibernation                          = false -> null%0A      - id                                   = "i-050dbbd991d26ba08" -> null%0A      - instance_initiated_shutdown_behavior = "stop" -> null%0A      - instance_state                       = "running" -> null%0A      - instance_type                        = "t2.micro" -> null%0A      - ipv6_address_count                   = 0 -> null%0A      - ipv6_addresses                       = [] -> null%0A      - key_name                             = "prod" -> null%0A      - monitoring                           = false -> null%0A      - placement_partition_number           = 0 -> null%0A      - primary_network_interface_id         = "eni-08cb301a82e4a9eb4" -> null%0A      - private_dns                          = "ip-10-1-1-248.ec2.internal" -> null%0A      - private_ip                           = "10.1.1.248" -> null%0A      - public_ip                            = "52.201.250.8" -> null%0A      - secondary_private_ips                = [] -> null%0A      - security_groups                      = [%0A          - "sg-032b6be408d47fb02",%0A        ] -> null%0A      - source_dest_check                    = true -> null%0A      - subnet_id                            = "subnet-0d086efe053e7ace8" -> null%0A      - tags                                 = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-Amazon-Linux-Webserver"%0A          - "Owner" = "CAAacs730"%0A          - "Role"  = "WebServerON"%0A          - "env"   = "prod"%0A        } -> null%0A      - tags_all                             = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-Amazon-Linux-Webserver"%0A          - "Owner" = "CAAacs730"%0A          - "Role"  = "WebServerON"%0A          - "env"   = "prod"%0A        } -> null%0A      - tenancy                              = "default" -> null%0A      - user_data                            = "7ae0de85c810d44000acfd1005ef1efe8e16fbbf" -> null%0A      - user_data_replace_on_change          = false -> null%0A      - vpc_security_group_ids               = [%0A          - "sg-032b6be408d47fb02",%0A        ] -> null%0A%0A      - capacity_reservation_specification {%0A          - capacity_reservation_preference = "open" -> null%0A        }%0A%0A      - cpu_options {%0A          - core_count       = 1 -> null%0A          - threads_per_core = 1 -> null%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      - enclave_options {%0A          - enabled = false -> null%0A        }%0A%0A      - maintenance_options {%0A          - auto_recovery = "default" -> null%0A        }%0A%0A      - metadata_options {%0A          - http_endpoint               = "enabled" -> null%0A          - http_protocol_ipv6          = "disabled" -> null%0A          - http_put_response_hop_limit = 1 -> null%0A          - http_tokens                 = "optional" -> null%0A          - instance_metadata_tags      = "disabled" -> null%0A        }%0A%0A      - private_dns_name_options {%0A          - enable_resource_name_dns_a_record    = false -> null%0A          - enable_resource_name_dns_aaaa_record = false -> null%0A          - hostname_type                        = "ip-name" -> null%0A        }%0A%0A      - root_block_device {%0A          - delete_on_termination = true -> null%0A          - device_name           = "/dev/xvda" -> null%0A          - encrypted             = false -> null%0A          - iops                  = 100 -> null%0A          - tags                  = {} -> null%0A          - throughput            = 0 -> null%0A          - volume_id             = "vol-095b2032a82a30ca5" -> null%0A          - volume_size           = 8 -> null%0A          - volume_type           = "gp2" -> null%0A        }%0A    }%0A%0A  # aws_instance.acs730-webserver[1] has been deleted%0A  - resource "aws_instance" "acs730-webserver" {%0A      - ami                                  = "ami-05034109c18473f00" -> null%0A      - arn                                  = "arn:aws:ec2:us-east-1:775273113262:instance/i-0048e18d841e052f3" -> null%0A      - associate_public_ip_address          = true -> null%0A      - availability_zone                    = "us-east-1b" -> null%0A      - cpu_core_count                       = 1 -> null%0A      - cpu_threads_per_core                 = 1 -> null%0A      - disable_api_stop                     = false -> null%0A      - disable_api_termination              = false -> null%0A      - ebs_optimized                        = false -> null%0A      - get_password_data                    = false -> null%0A      - hibernation                          = false -> null%0A      - id                                   = "i-0048e18d841e052f3" -> null%0A      - instance_initiated_shutdown_behavior = "stop" -> null%0A      - instance_state                       = "running" -> null%0A      - instance_type                        = "t2.micro" -> null%0A      - ipv6_address_count                   = 0 -> null%0A      - ipv6_addresses                       = [] -> null%0A      - key_name                             = "prod" -> null%0A      - monitoring                           = false -> null%0A      - placement_partition_number           = 0 -> null%0A      - primary_network_interface_id         = "eni-090a96c868c7f1511" -> null%0A      - private_dns                          = "ip-10-1-2-81.ec2.internal" -> null%0A      - private_ip                           = "10.1.2.81" -> null%0A      - public_ip                            = "3.237.235.61" -> null%0A      - secondary_private_ips                = [] -> null%0A      - security_groups                      = [%0A          - "sg-032b6be408d47fb02",%0A        ] -> null%0A      - source_dest_check                    = true -> null%0A      - subnet_id                            = "subnet-0997e4f4644774cc7" -> null%0A      - tags                                 = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-Amazon-Linux-Webserver"%0A          - "Owner" = "CAAacs730"%0A          - "Role"  = "WebServerON"%0A          - "env"   = "prod"%0A        } -> null%0A      - tags_all                             = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-Amazon-Linux-Webserver"%0A          - "Owner" = "CAAacs730"%0A          - "Role"  = "WebServerON"%0A          - "env"   = "prod"%0A        } -> null%0A      - tenancy                              = "default" -> null%0A      - user_data                            = "7ae0de85c810d44000acfd1005ef1efe8e16fbbf" -> null%0A      - user_data_replace_on_change          = false -> null%0A      - vpc_security_group_ids               = [%0A          - "sg-032b6be408d47fb02",%0A        ] -> null%0A%0A      - capacity_reservation_specification {%0A          - capacity_reservation_preference = "open" -> null%0A        }%0A%0A      - cpu_options {%0A          - core_count       = 1 -> null%0A          - threads_per_core = 1 -> null%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      - enclave_options {%0A          - enabled = false -> null%0A        }%0A%0A      - maintenance_options {%0A          - auto_recovery = "default" -> null%0A        }%0A%0A      - metadata_options {%0A          - http_endpoint               = "enabled" -> null%0A          - http_protocol_ipv6          = "disabled" -> null%0A          - http_put_response_hop_limit = 1 -> null%0A          - http_tokens                 = "optional" -> null%0A          - instance_metadata_tags      = "disabled" -> null%0A        }%0A%0A      - private_dns_name_options {%0A          - enable_resource_name_dns_a_record    = false -> null%0A          - enable_resource_name_dns_aaaa_record = false -> null%0A          - hostname_type                        = "ip-name" -> null%0A        }%0A%0A      - root_block_device {%0A          - delete_on_termination = true -> null%0A          - device_name           = "/dev/xvda" -> null%0A          - encrypted             = false -> null%0A          - iops                  = 100 -> null%0A          - tags                  = {} -> null%0A          - throughput            = 0 -> null%0A          - volume_id             = "vol-0c9c81041ac094cbb" -> null%0A          - volume_size           = 8 -> null%0A          - volume_type           = "gp2" -> null%0A        }%0A    }%0A%0A  # aws_instance.acs730-webserver[2] has been deleted%0A  - resource "aws_instance" "acs730-webserver" {%0A      - ami                                  = "ami-05034109c18473f00" -> null%0A      - arn                                  = "arn:aws:ec2:us-east-1:775273113262:instance/i-065909d5d1e423a4f" -> null%0A      - associate_public_ip_address          = true -> null%0A      - availability_zone                    = "us-east-1c" -> null%0A      - cpu_core_count                       = 1 -> null%0A      - cpu_threads_per_core                 = 1 -> null%0A      - disable_api_stop                     = false -> null%0A      - disable_api_termination              = false -> null%0A      - ebs_optimized                        = false -> null%0A      - get_password_data                    = false -> null%0A      - hibernation                          = false -> null%0A      - id                                   = "i-065909d5d1e423a4f" -> null%0A      - instance_initiated_shutdown_behavior = "stop" -> null%0A      - instance_state                       = "running" -> null%0A      - instance_type                        = "t2.micro" -> null%0A      - ipv6_address_count                   = 0 -> null%0A      - ipv6_addresses                       = [] -> null%0A      - key_name                             = "prod" -> null%0A      - monitoring                           = false -> null%0A      - placement_partition_number           = 0 -> null%0A      - primary_network_interface_id         = "eni-0c74a439c4940a7a3" -> null%0A      - private_dns                          = "ip-10-1-3-221.ec2.internal" -> null%0A      - private_ip                           = "10.1.3.221" -> null%0A      - public_ip                            = "44.211.43.126" -> null%0A      - secondary_private_ips                = [] -> null%0A      - security_groups                      = [%0A          - "sg-032b6be408d47fb02",%0A        ] -> null%0A      - source_dest_check                    = true -> null%0A      - subnet_id                            = "subnet-01960b7eff4043185" -> null%0A      - tags                                 = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-Amazon-Linux-Webserver"%0A          - "Owner" = "CAAacs730"%0A          - "Role"  = "WebServerOFF"%0A          - "env"   = "prod"%0A        } -> null%0A      - tags_all                             = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-Amazon-Linux-Webserver"%0A          - "Owner" = "CAAacs730"%0A          - "Role"  = "WebServerOFF"%0A          - "env"   = "prod"%0A        } -> null%0A      - tenancy                              = "default" -> null%0A      - user_data_replace_on_change          = false -> null%0A      - vpc_security_group_ids               = [%0A          - "sg-032b6be408d47fb02",%0A        ] -> null%0A%0A      - capacity_reservation_specification {%0A          - capacity_reservation_preference = "open" -> null%0A        }%0A%0A      - cpu_options {%0A          - core_count       = 1 -> null%0A          - threads_per_core = 1 -> null%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      - enclave_options {%0A          - enabled = false -> null%0A        }%0A%0A      - maintenance_options {%0A          - auto_recovery = "default" -> null%0A        }%0A%0A      - metadata_options {%0A          - http_endpoint               = "enabled" -> null%0A          - http_protocol_ipv6          = "disabled" -> null%0A          - http_put_response_hop_limit = 1 -> null%0A          - http_tokens                 = "optional" -> null%0A          - instance_metadata_tags      = "disabled" -> null%0A        }%0A%0A      - private_dns_name_options {%0A          - enable_resource_name_dns_a_record    = false -> null%0A          - enable_resource_name_dns_aaaa_record = false -> null%0A          - hostname_type                        = "ip-name" -> null%0A        }%0A%0A      - root_block_device {%0A          - delete_on_termination = true -> null%0A          - device_name           = "/dev/xvda" -> null%0A          - encrypted             = false -> null%0A          - iops                  = 100 -> null%0A          - tags                  = {} -> null%0A          - throughput            = 0 -> null%0A          - volume_id             = "vol-0945d80942029d488" -> null%0A          - volume_size           = 8 -> null%0A          - volume_type           = "gp2" -> null%0A        }%0A    }%0A%0A  # aws_instance.acs730-webserver[3] has been deleted%0A  - resource "aws_instance" "acs730-webserver" {%0A      - ami                                  = "ami-05034109c18473f00" -> null%0A      - arn                                  = "arn:aws:ec2:us-east-1:775273113262:instance/i-0ca161d85b33698c2" -> null%0A      - associate_public_ip_address          = true -> null%0A      - availability_zone                    = "us-east-1d" -> null%0A      - cpu_core_count                       = 1 -> null%0A      - cpu_threads_per_core                 = 1 -> null%0A      - disable_api_stop                     = false -> null%0A      - disable_api_termination              = false -> null%0A      - ebs_optimized                        = false -> null%0A      - get_password_data                    = false -> null%0A      - hibernation                          = false -> null%0A      - id                                   = "i-0ca161d85b33698c2" -> null%0A      - instance_initiated_shutdown_behavior = "stop" -> null%0A      - instance_state                       = "running" -> null%0A      - instance_type                        = "t2.micro" -> null%0A      - ipv6_address_count                   = 0 -> null%0A      - ipv6_addresses                       = [] -> null%0A      - key_name                             = "prod" -> null%0A      - monitoring                           = false -> null%0A      - placement_partition_number           = 0 -> null%0A      - primary_network_interface_id         = "eni-06d24f350efef2496" -> null%0A      - private_dns                          = "ip-10-1-4-54.ec2.internal" -> null%0A      - private_ip                           = "10.1.4.54" -> null%0A      - public_ip                            = "34.207.145.97" -> null%0A      - secondary_private_ips                = [] -> null%0A      - security_groups                      = [%0A          - "sg-032b6be408d47fb02",%0A        ] -> null%0A      - source_dest_check                    = true -> null%0A      - subnet_id                            = "subnet-02967dda1c7a2a3ee" -> null%0A      - tags                                 = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-Amazon-Linux-Webserver"%0A          - "Owner" = "CAAacs730"%0A          - "Role"  = "WebServerOFF"%0A          - "env"   = "prod"%0A        } -> null%0A      - tags_all                             = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-Amazon-Linux-Webserver"%0A          - "Owner" = "CAAacs730"%0A          - "Role"  = "WebServerOFF"%0A          - "env"   = "prod"%0A        } -> null%0A      - tenancy                              = "default" -> null%0A      - user_data_replace_on_change          = false -> null%0A      - vpc_security_group_ids               = [%0A          - "sg-032b6be408d47fb02",%0A        ] -> null%0A%0A      - capacity_reservation_specification {%0A          - capacity_reservation_preference = "open" -> null%0A        }%0A%0A      - cpu_options {%0A          - core_count       = 1 -> null%0A          - threads_per_core = 1 -> null%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      - enclave_options {%0A          - enabled = false -> null%0A        }%0A%0A      - maintenance_options {%0A          - auto_recovery = "default" -> null%0A        }%0A%0A      - metadata_options {%0A          - http_endpoint               = "enabled" -> null%0A          - http_protocol_ipv6          = "disabled" -> null%0A          - http_put_response_hop_limit = 1 -> null%0A          - http_tokens                 = "optional" -> null%0A          - instance_metadata_tags      = "disabled" -> null%0A        }%0A%0A      - private_dns_name_options {%0A          - enable_resource_name_dns_a_record    = false -> null%0A          - enable_resource_name_dns_aaaa_record = false -> null%0A          - hostname_type                        = "ip-name" -> null%0A        }%0A%0A      - root_block_device {%0A          - delete_on_termination = true -> null%0A          - device_name           = "/dev/xvda" -> null%0A          - encrypted             = false -> null%0A          - iops                  = 100 -> null%0A          - tags                  = {} -> null%0A          - throughput            = 0 -> null%0A          - volume_id             = "vol-0a854e29384d5d151" -> null%0A          - volume_size           = 8 -> null%0A          - volume_type           = "gp2" -> null%0A        }%0A    }%0A%0A  # aws_instance.acs730gp[0] has been deleted%0A  - resource "aws_instance" "acs730gp" {%0A      - ami                                  = "ami-05034109c18473f00" -> null%0A      - arn                                  = "arn:aws:ec2:us-east-1:775273113262:instance/i-01c00ccfb29372f43" -> null%0A      - associate_public_ip_address          = false -> null%0A      - availability_zone                    = "us-east-1a" -> null%0A      - cpu_core_count                       = 1 -> null%0A      - cpu_threads_per_core                 = 1 -> null%0A      - disable_api_stop                     = false -> null%0A      - disable_api_termination              = false -> null%0A      - ebs_optimized                        = false -> null%0A      - get_password_data                    = false -> null%0A      - hibernation                          = false -> null%0A      - id                                   = "i-01c00ccfb29372f43" -> null%0A      - instance_initiated_shutdown_behavior = "stop" -> null%0A      - instance_state                       = "running" -> null%0A      - instance_type                        = "t2.micro" -> null%0A      - ipv6_address_count                   = 0 -> null%0A      - ipv6_addresses                       = [] -> null%0A      - key_name                             = "prod" -> null%0A      - monitoring                           = false -> null%0A      - placement_partition_number           = 0 -> null%0A      - primary_network_interface_id         = "eni-020b612838189ad06" -> null%0A      - private_dns                          = "ip-10-1-5-142.ec2.internal" -> null%0A      - private_ip                           = "10.1.5.142" -> null%0A      - secondary_private_ips                = [] -> null%0A      - security_groups                      = [%0A          - "sg-04d4f903a7bea2056",%0A        ] -> null%0A      - source_dest_check                    = true -> null%0A      - subnet_id                            = "subnet-0ba99574219d86833" -> null%0A      - tags                                 = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-Amazon-Linux-Private"%0A          - "Owner" = "CAAacs730"%0A          - "env"   = "prod"%0A        } -> null%0A      - tags_all                             = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-Amazon-Linux-Private"%0A          - "Owner" = "CAAacs730"%0A          - "env"   = "prod"%0A        } -> null%0A      - tenancy                              = "default" -> null%0A      - user_data_replace_on_change          = false -> null%0A      - vpc_security_group_ids               = [%0A          - "sg-04d4f903a7bea2056",%0A        ] -> null%0A%0A      - capacity_reservation_specification {%0A          - capacity_reservation_preference = "open" -> null%0A        }%0A%0A      - cpu_options {%0A          - core_count       = 1 -> null%0A          - threads_per_core = 1 -> null%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      - enclave_options {%0A          - enabled = false -> null%0A        }%0A%0A      - maintenance_options {%0A          - auto_recovery = "default" -> null%0A        }%0A%0A      - metadata_options {%0A          - http_endpoint               = "enabled" -> null%0A          - http_protocol_ipv6          = "disabled" -> null%0A          - http_put_response_hop_limit = 1 -> null%0A          - http_tokens                 = "optional" -> null%0A          - instance_metadata_tags      = "disabled" -> null%0A        }%0A%0A      - private_dns_name_options {%0A          - enable_resource_name_dns_a_record    = false -> null%0A          - enable_resource_name_dns_aaaa_record = false -> null%0A          - hostname_type                        = "ip-name" -> null%0A        }%0A%0A      - root_block_device {%0A          - delete_on_termination = true -> null%0A          - device_name           = "/dev/xvda" -> null%0A          - encrypted             = false -> null%0A          - iops                  = 100 -> null%0A          - tags                  = {} -> null%0A          - throughput            = 0 -> null%0A          - volume_id             = "vol-0ec49f9743ccb34df" -> null%0A          - volume_size           = 8 -> null%0A          - volume_type           = "gp2" -> null%0A        }%0A    }%0A%0A  # aws_instance.acs730gp[1] has been deleted%0A  - resource "aws_instance" "acs730gp" {%0A      - ami                                  = "ami-05034109c18473f00" -> null%0A      - arn                                  = "arn:aws:ec2:us-east-1:775273113262:instance/i-0b78f01c6bec5cfec" -> null%0A      - associate_public_ip_address          = false -> null%0A      - availability_zone                    = "us-east-1b" -> null%0A      - cpu_core_count                       = 1 -> null%0A      - cpu_threads_per_core                 = 1 -> null%0A      - disable_api_stop                     = false -> null%0A      - disable_api_termination              = false -> null%0A      - ebs_optimized                        = false -> null%0A      - get_password_data                    = false -> null%0A      - hibernation                          = false -> null%0A      - id                                   = "i-0b78f01c6bec5cfec" -> null%0A      - instance_initiated_shutdown_behavior = "stop" -> null%0A      - instance_state                       = "running" -> null%0A      - instance_type                        = "t2.micro" -> null%0A      - ipv6_address_count                   = 0 -> null%0A      - ipv6_addresses                       = [] -> null%0A      - key_name                             = "prod" -> null%0A      - monitoring                           = false -> null%0A      - placement_partition_number           = 0 -> null%0A      - primary_network_interface_id         = "eni-01bd5a85b0982fead" -> null%0A      - private_dns                          = "ip-10-1-6-78.ec2.internal" -> null%0A      - private_ip                           = "10.1.6.78" -> null%0A      - secondary_private_ips                = [] -> null%0A      - security_groups                      = [%0A          - "sg-04d4f903a7bea2056",%0A        ] -> null%0A      - source_dest_check                    = true -> null%0A      - subnet_id                            = "subnet-075a425987d17481c" -> null%0A      - tags                                 = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-Amazon-Linux-Private"%0A          - "Owner" = "CAAacs730"%0A          - "env"   = "prod"%0A        } -> null%0A      - tags_all                             = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-Amazon-Linux-Private"%0A          - "Owner" = "CAAacs730"%0A          - "env"   = "prod"%0A        } -> null%0A      - tenancy                              = "default" -> null%0A      - user_data_replace_on_change          = false -> null%0A      - vpc_security_group_ids               = [%0A          - "sg-04d4f903a7bea2056",%0A        ] -> null%0A%0A      - capacity_reservation_specification {%0A          - capacity_reservation_preference = "open" -> null%0A        }%0A%0A      - cpu_options {%0A          - core_count       = 1 -> null%0A          - threads_per_core = 1 -> null%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      - enclave_options {%0A          - enabled = false -> null%0A        }%0A%0A      - maintenance_options {%0A          - auto_recovery = "default" -> null%0A        }%0A%0A      - metadata_options {%0A          - http_endpoint               = "enabled" -> null%0A          - http_protocol_ipv6          = "disabled" -> null%0A          - http_put_response_hop_limit = 1 -> null%0A          - http_tokens                 = "optional" -> null%0A          - instance_metadata_tags      = "disabled" -> null%0A        }%0A%0A      - private_dns_name_options {%0A          - enable_resource_name_dns_a_record    = false -> null%0A          - enable_resource_name_dns_aaaa_record = false -> null%0A          - hostname_type                        = "ip-name" -> null%0A        }%0A%0A      - root_block_device {%0A          - delete_on_termination = true -> null%0A          - device_name           = "/dev/xvda" -> null%0A          - encrypted             = false -> null%0A          - iops                  = 100 -> null%0A          - tags                  = {} -> null%0A          - throughput            = 0 -> null%0A          - volume_id             = "vol-00b22ca04a6a35e5d" -> null%0A          - volume_size           = 8 -> null%0A          - volume_type           = "gp2" -> null%0A        }%0A    }%0A%0A  # aws_key_pair.web_key has changed%0A  ~ resource "aws_key_pair" "web_key" {%0A        id          = "prod"%0A      + tags        = {}%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # aws_security_group.web_sg has been deleted%0A  - resource "aws_security_group" "web_sg" {%0A      - arn                    = "arn:aws:ec2:us-east-1:775273113262:security-group/sg-04d4f903a7bea2056" -> null%0A      - description            = "Allow SSH inbound traffic" -> null%0A      - egress                 = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = [%0A                  - "::/0",%0A                ]%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 0%0A            },%0A        ] -> null%0A      - id                     = "sg-04d4f903a7bea2056" -> null%0A      - ingress                = [%0A          - {%0A              - cidr_blocks      = []%0A              - description      = ""%0A              - from_port        = 22%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = [%0A                  - "sg-032b6be408d47fb02",%0A                ]%0A              - self             = false%0A              - to_port          = 22%0A            },%0A        ] -> null%0A      - name                   = "allow_ssh" -> null%0A      - owner_id               = "775273113262" -> null%0A      - revoke_rules_on_delete = false -> null%0A      - tags                   = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-SG-Private-nonprod"%0A          - "Owner" = "CAAacs730"%0A          - "env"   = "prod"%0A        } -> null%0A      - tags_all               = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-SG-Private-nonprod"%0A          - "Owner" = "CAAacs730"%0A          - "env"   = "prod"%0A        } -> null%0A      - vpc_id                 = "vpc-00bbdff316127afad" -> null%0A    }%0A%0A  # aws_security_group.web_sg_public has been deleted%0A  - resource "aws_security_group" "web_sg_public" {%0A      - arn                    = "arn:aws:ec2:us-east-1:775273113262:security-group/sg-032b6be408d47fb02" -> null%0A      - description            = "Allow HTTP and SSH inbound traffic" -> null%0A      - egress                 = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = [%0A                  - "::/0",%0A                ]%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 0%0A            },%0A        ] -> null%0A      - id                     = "sg-032b6be408d47fb02" -> null%0A      - ingress                = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = "HTTP from everywhere"%0A              - from_port        = 80%0A              - ipv6_cidr_blocks = [%0A                  - "::/0",%0A                ]%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 80%0A            },%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = "SSH from everywhere"%0A              - from_port        = 22%0A              - ipv6_cidr_blocks = [%0A                  - "::/0",%0A                ]%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 22%0A            },%0A        ] -> null%0A      - name                   = "allow_http_ssh" -> null%0A      - owner_id               = "775273113262" -> null%0A      - revoke_rules_on_delete = false -> null%0A      - tags                   = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-SG-Public-nonprod"%0A          - "Owner" = "CAAacs730"%0A          - "env"   = "prod"%0A        } -> null%0A      - tags_all               = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-SG-Public-nonprod"%0A          - "Owner" = "CAAacs730"%0A          - "env"   = "prod"%0A        } -> null%0A      - vpc_id                 = "vpc-00bbdff316127afad" -> null%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_instance.acs730-webserver[0] will be created%0A  + resource "aws_instance" "acs730-webserver" {%0A      + ami                                  = "ami-05034109c18473f00"%0A      + arn                                  = (known after apply)%0A      + associate_public_ip_address          = true%0A      + availability_zone                    = (known after apply)%0A      + cpu_core_count                       = (known after apply)%0A      + cpu_threads_per_core                 = (known after apply)%0A      + disable_api_stop                     = (known after apply)%0A      + disable_api_termination              = (known after apply)%0A      + ebs_optimized                        = (known after apply)%0A      + get_password_data                    = false%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + iam_instance_profile                 = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_initiated_shutdown_behavior = (known after apply)%0A      + instance_lifecycle                   = (known after apply)%0A      + instance_state                       = (known after apply)%0A      + instance_type                        = "t2.micro"%0A      + ipv6_address_count                   = (known after apply)%0A      + ipv6_addresses                       = (known after apply)%0A      + key_name                             = "prod"%0A      + monitoring                           = (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      + primary_network_interface_id         = (known after apply)%0A      + private_dns                          = (known after apply)%0A      + private_ip                           = (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      + secondary_private_ips                = (known after apply)%0A      + security_groups                      = (known after apply)%0A      + source_dest_check                    = true%0A      + spot_instance_request_id             = (known after apply)%0A      + subnet_id                            = "subnet-0d086efe053e7ace8"%0A      + tags                                 = {%0A          + "App"   = "Web"%0A          + "Name"  = "prod-Amazon-Linux-Webserver"%0A          + "Owner" = "CAAacs730"%0A          + "Role"  = "WebServerON"%0A          + "env"   = "prod"%0A        }%0A      + tags_all                             = {%0A          + "App"   = "Web"%0A          + "Name"  = "prod-Amazon-Linux-Webserver"%0A          + "Owner" = "CAAacs730"%0A          + "Role"  = "WebServerON"%0A          + "env"   = "prod"%0A        }%0A      + tenancy                              = (known after apply)%0A      + user_data                            = "7ae0de85c810d44000acfd1005ef1efe8e16fbbf"%0A      + user_data_base64                     = (known after apply)%0A      + user_data_replace_on_change          = false%0A      + vpc_security_group_ids               = (known after apply)%0A%0A      + capacity_reservation_specification {%0A          + capacity_reservation_preference = (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      + cpu_options {%0A          + amd_sev_snp      = (known after apply)%0A          + core_count       = (known after apply)%0A          + threads_per_core = (known after apply)%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      + enclave_options {%0A          + enabled = (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + instance_market_options {%0A          + market_type = (known after apply)%0A%0A          + spot_options {%0A              + instance_interruption_behavior = (known after apply)%0A              + max_price                      = (known after apply)%0A              + spot_instance_type             = (known after apply)%0A              + valid_until                    = (known after apply)%0A            }%0A        }%0A%0A      + maintenance_options {%0A          + auto_recovery = (known after apply)%0A        }%0A%0A      + metadata_options {%0A          + http_endpoint               = (known after apply)%0A          + http_protocol_ipv6          = (known after apply)%0A          + http_put_response_hop_limit = (known after apply)%0A          + http_tokens                 = (known after apply)%0A          + instance_metadata_tags      = (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_card_index    = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      + private_dns_name_options {%0A          + enable_resource_name_dns_a_record    = (known after apply)%0A          + enable_resource_name_dns_aaaa_record = (known after apply)%0A          + hostname_type                        = (known after apply)%0A        }%0A%0A      + root_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A    }%0A%0A  # aws_instance.acs730-webserver[1] will be created%0A  + resource "aws_instance" "acs730-webserver" {%0A      + ami                                  = "ami-05034109c18473f00"%0A      + arn                                  = (known after apply)%0A      + associate_public_ip_address          = true%0A      + availability_zone                    = (known after apply)%0A      + cpu_core_count                       = (known after apply)%0A      + cpu_threads_per_core                 = (known after apply)%0A      + disable_api_stop                     = (known after apply)%0A      + disable_api_termination              = (known after apply)%0A      + ebs_optimized                        = (known after apply)%0A      + get_password_data                    = false%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + iam_instance_profile                 = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_initiated_shutdown_behavior = (known after apply)%0A      + instance_lifecycle                   = (known after apply)%0A      + instance_state                       = (known after apply)%0A      + instance_type                        = "t2.micro"%0A      + ipv6_address_count                   = (known after apply)%0A      + ipv6_addresses                       = (known after apply)%0A      + key_name                             = "prod"%0A      + monitoring                           = (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      + primary_network_interface_id         = (known after apply)%0A      + private_dns                          = (known after apply)%0A      + private_ip                           = (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      + secondary_private_ips                = (known after apply)%0A      + security_groups                      = (known after apply)%0A      + source_dest_check                    = true%0A      + spot_instance_request_id             = (known after apply)%0A      + subnet_id                            = "subnet-0997e4f4644774cc7"%0A      + tags                                 = {%0A          + "App"   = "Web"%0A          + "Name"  = "prod-Amazon-Linux-Webserver"%0A          + "Owner" = "CAAacs730"%0A          + "Role"  = "WebServerON"%0A          + "env"   = "prod"%0A        }%0A      + tags_all                             = {%0A          + "App"   = "Web"%0A          + "Name"  = "prod-Amazon-Linux-Webserver"%0A          + "Owner" = "CAAacs730"%0A          + "Role"  = "WebServerON"%0A          + "env"   = "prod"%0A        }%0A      + tenancy                              = (known after apply)%0A      + user_data                            = "7ae0de85c810d44000acfd1005ef1efe8e16fbbf"%0A      + user_data_base64                     = (known after apply)%0A      + user_data_replace_on_change          = false%0A      + vpc_security_group_ids               = (known after apply)%0A%0A      + capacity_reservation_specification {%0A          + capacity_reservation_preference = (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      + cpu_options {%0A          + amd_sev_snp      = (known after apply)%0A          + core_count       = (known after apply)%0A          + threads_per_core = (known after apply)%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      + enclave_options {%0A          + enabled = (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + instance_market_options {%0A          + market_type = (known after apply)%0A%0A          + spot_options {%0A              + instance_interruption_behavior = (known after apply)%0A              + max_price                      = (known after apply)%0A              + spot_instance_type             = (known after apply)%0A              + valid_until                    = (known after apply)%0A            }%0A        }%0A%0A      + maintenance_options {%0A          + auto_recovery = (known after apply)%0A        }%0A%0A      + metadata_options {%0A          + http_endpoint               = (known after apply)%0A          + http_protocol_ipv6          = (known after apply)%0A          + http_put_response_hop_limit = (known after apply)%0A          + http_tokens                 = (known after apply)%0A          + instance_metadata_tags      = (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_card_index    = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      + private_dns_name_options {%0A          + enable_resource_name_dns_a_record    = (known after apply)%0A          + enable_resource_name_dns_aaaa_record = (known after apply)%0A          + hostname_type                        = (known after apply)%0A        }%0A%0A      + root_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A    }%0A%0A  # aws_instance.acs730-webserver[2] will be created%0A  + resource "aws_instance" "acs730-webserver" {%0A      + ami                                  = "ami-05034109c18473f00"%0A      + arn                                  = (known after apply)%0A      + associate_public_ip_address          = true%0A      + availability_zone                    = (known after apply)%0A      + cpu_core_count                       = (known after apply)%0A      + cpu_threads_per_core                 = (known after apply)%0A      + disable_api_stop                     = (known after apply)%0A      + disable_api_termination              = (known after apply)%0A      + ebs_optimized                        = (known after apply)%0A      + get_password_data                    = false%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + iam_instance_profile                 = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_initiated_shutdown_behavior = (known after apply)%0A      + instance_lifecycle                   = (known after apply)%0A      + instance_state                       = (known after apply)%0A      + instance_type                        = "t2.micro"%0A      + ipv6_address_count                   = (known after apply)%0A      + ipv6_addresses                       = (known after apply)%0A      + key_name                             = "prod"%0A      + monitoring                           = (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      + primary_network_interface_id         = (known after apply)%0A      + private_dns                          = (known after apply)%0A      + private_ip                           = (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      + secondary_private_ips                = (known after apply)%0A      + security_groups                      = (known after apply)%0A      + source_dest_check                    = true%0A      + spot_instance_request_id             = (known after apply)%0A      + subnet_id                            = "subnet-01960b7eff4043185"%0A      + tags                                 = {%0A          + "App"   = "Web"%0A          + "Name"  = "prod-Amazon-Linux-Webserver"%0A          + "Owner" = "CAAacs730"%0A          + "Role"  = "WebServerOFF"%0A          + "env"   = "prod"%0A        }%0A      + tags_all                             = {%0A          + "App"   = "Web"%0A          + "Name"  = "prod-Amazon-Linux-Webserver"%0A          + "Owner" = "CAAacs730"%0A          + "Role"  = "WebServerOFF"%0A          + "env"   = "prod"%0A        }%0A      + tenancy                              = (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      + user_data_replace_on_change          = false%0A      + vpc_security_group_ids               = (known after apply)%0A%0A      + capacity_reservation_specification {%0A          + capacity_reservation_preference = (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      + cpu_options {%0A          + amd_sev_snp      = (known after apply)%0A          + core_count       = (known after apply)%0A          + threads_per_core = (known after apply)%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      + enclave_options {%0A          + enabled = (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + instance_market_options {%0A          + market_type = (known after apply)%0A%0A          + spot_options {%0A              + instance_interruption_behavior = (known after apply)%0A              + max_price                      = (known after apply)%0A              + spot_instance_type             = (known after apply)%0A              + valid_until                    = (known after apply)%0A            }%0A        }%0A%0A      + maintenance_options {%0A          + auto_recovery = (known after apply)%0A        }%0A%0A      + metadata_options {%0A          + http_endpoint               = (known after apply)%0A          + http_protocol_ipv6          = (known after apply)%0A          + http_put_response_hop_limit = (known after apply)%0A          + http_tokens                 = (known after apply)%0A          + instance_metadata_tags      = (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_card_index    = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      + private_dns_name_options {%0A          + enable_resource_name_dns_a_record    = (known after apply)%0A          + enable_resource_name_dns_aaaa_record = (known after apply)%0A          + hostname_type                        = (known after apply)%0A        }%0A%0A      + root_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + tags                  = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A    }%0A%0A  # aws_instance.acs730-webserver[3] will be created%0A  + resource "aws_instance" "acs730-webserver" {%0A      + ami                                  = "ami-05034109c18473f00"%0A      + arn                                  = (known after apply)%0A      + associate_public_ip_address          = true%0A      + availability_zone                    = (known after apply)%0A      + cpu_core_count                       = (known after apply)%0A      + cpu_threads_per_core                 = (known after apply)%0A      + disable_api_stop                     = (known after apply)%0A      + disable_api_termination              = (known after apply)%0A      + ebs_optimized                        = (known after apply)%0A      + get_password_data                    = false%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + iam_instance_profile                 = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_initiated_shutdown_behavior = (known after apply)%0A      + instance_lifecycle                   = (known after apply)%0A      + instance_state                       = (known after apply)%0A      + instance_type                        = "t2.micro"%0A      + ipv6_address_count                   = (known after apply)%0A      + ipv6_addresses                       = (known after apply)%0A      + key_name                             = "prod"%0A      + monitoring                           = (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_partition_number           = (known after apply)%0A      + primary_network_interface_id         = (known after apply)%0A      + private_dns                          = (known after apply)%0A      + private_ip                           = (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      + secondary_private_ips                = (known after apply)%0A      + security_groups                      = (known after apply)%0A      + source_dest_c
  ```
  </details>
  *Pusher: @Gaurav-17, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform - Staging`*